'''

# https://blog.naver.com/dsyun96/221843554389

pow(2, 3)   pow(2, 2)   pow(2, 1)   pow(2, 0)
0           0           0           0
0           0           0           1
0           0           1           0
0           0           1           1
0           1           0           0
0           1           0           1
0           1           1           0
0           1           1           1
1           0           0           0
1           0           0           1
1           0           1           0
1           0           1           1
1           1           0           0
1           1           0           1
1           1           1           0
1           1           1           1

이렇게 2진수로 차례대로 적고 규칙을 찾기(ex : 각 열에서 주기 찾기 등)



'''
